erik-elemind/monorepo/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMXRT685S
package_id: MIMXRT685SFVKB
mcu_data: ksdk2_0
processor_version: 12.0.1
pin_labels:
- {pin_num: G2, pin_signal: PIO0_1/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT1/I2S_BRIDGE_WS_IN/SEC_PIO0_1, label: BT_UART_TXD, identifier: BT_UART_TXD}
- {pin_num: F4, pin_signal: PIO0_5/FC0_SSEL2/SCT0_GPI0/SCT0_OUT0/CTIMER_INP1/SEC_PIO0_5/ADC0_0, label: TEMP_SENSE_BAND, identifier: TEMP_SENSE_BAND}
- {pin_num: G3, pin_signal: PIO0_13/FC1_SSEL3/SCT0_GPI3/SCT0_OUT3/CTIMER0_MAT1/SEC_PIO0_13/ADC0_9, label: ADC_NTC1, identifier: ADC_NTC1}
- {pin_num: U16, pin_signal: PIO2_7/SD0_D6/SCT0_GPI5/CTIMER1_MAT1, label: EEG_LDO_EN, identifier: EEG_LDO_EN}
- {pin_num: T9, pin_signal: PIO1_18/FLEXSPI0A_SCLK/SCT0_GPI0/CTIMER3_MAT3, label: NAND_SCK, identifier: NAND_SCK}
- {pin_num: T4, pin_signal: PIO1_19/FLEXSPI0A_SS0_N/SCT0_OUT0/CTIMER4_MAT0, label: NAND_CSn, identifier: NAND_CSn}
- {pin_num: T5, pin_signal: PIO1_20/FLEXSPI0A_DATA0/SCT0_GPI1/CTIMER4_MAT1, label: NAND_D0, identifier: NAND_D0}
- {pin_num: U5, pin_signal: PIO1_21/FLEXSPI0A_DATA1/SCT0_OUT1/CTIMER4_MAT2, label: NAND_D1, identifier: NAND_D1}
- {pin_num: P6, pin_signal: PIO1_22/FLEXSPI0A_DATA2/SCT0_GPI2/CTIMER4_MAT3, label: NAND_D2, identifier: NAND_D2}
- {pin_num: P7, pin_signal: PIO1_23/FLEXSPI0A_DATA3/SCT0_OUT2/CTIMER_INP8, label: NAND_D3, identifier: NAND_D3}
- {pin_num: E1, pin_signal: PIO0_6/FC0_SSEL3/SCT0_GPI1/SCT0_OUT1/CTIMER0_MAT0/SEC_PIO0_6/ADC0_8, label: ADC_NTC0, identifier: ADC_NTC0}
- {pin_num: E3, pin_signal: PIO0_12/FC1_SSEL2/SCT0_GPI2/SCT0_OUT2/CTIMER_INP3/SEC_PIO0_12/ADC0_1, label: MEMS_BYPASS, identifier: MEMS_BYPASS}
- {pin_num: A3, pin_signal: PIO0_14/FC2_SCK/SCT0_GPI0/SCT0_OUT0/CTIMER2_MAT0/I2S_BRIDGE_CLK_IN/SEC_PIO0_14, label: MAX86140_SCK, identifier: MAX86140_SCK}
- {pin_num: A5, pin_signal: PIO0_15/FC2_TXD_SCL_MISO_WS/SCT0_GPI1/SCT0_OUT1/CTIMER2_MAT1/I2S_BRIDGE_WS_IN/SEC_PIO0_15, label: MAX86140_SDO, identifier: MAX86140_SDO}
- {pin_num: D7, pin_signal: PIO0_17/FC2_CTS_SDA_SSEL0/SCT0_GPI3/SCT0_OUT3/CTIMER2_MAT3/FC5_SSEL2/SEC_PIO0_17, label: MAX86140_CSB, identifier: MAX86140_CSB}
- {pin_num: A1, pin_signal: PIO0_19/FC2_SSEL2/SCT0_GPI4/SCT0_OUT4/CTIMER_INP5/UTICK_CAP0/SEC_PIO0_19/ADC0_2, label: VBATT_SENSE, identifier: VBATT_SENSE}
- {pin_num: C7, pin_signal: PIO0_21/FC3_SCK/CTIMER3_MAT0/TRACECLK/SEC_PIO0_21, label: BAT_STATn, identifier: BAT_STATn}
- {pin_num: C9, pin_signal: PIO0_23/FC3_RXD_SDA_MOSI_DATA/CTIMER3_MAT2/TRACEDATA(1)/SEC_PIO0_23, label: BAT_CD, identifier: BAT_CD}
- {pin_num: B9, pin_signal: PIO0_24/FC3_CTS_SDA_SSEL0/CTIMER3_MAT3/FC2_SSEL2/TRACEDATA(2)/CLKOUT/SEC_PIO0_24, label: I2C6_SDA, identifier: I2C6_SDA}
- {pin_num: A9, pin_signal: PIO0_25/FC3_RTS_SCL_SSEL1/FREQME_GPIO_CLK/CTIMER_INP6/FC2_SSEL3/TRACEDATA(3)/CLKIN/SEC_PIO0_25, label: I2C6_SCL, identifier: I2C6_SCL}
- {pin_num: A2, pin_signal: PIO0_26/FC3_SSEL2/SCT0_GPI6/SCT0_OUT6/CTIMER_INP7/SEC_PIO0_26/ADC0_3, label: LEDG_PWM, identifier: LEDG_PWM}
- {pin_num: B3, pin_signal: PIO0_27/FC3_SSEL3/SCT0_GPI7/SCT0_OUT7/CTIMER0_MAT3/SEC_PIO0_27/ADC0_11, label: LEDR_PWM, identifier: LEDR_PWM}
- {pin_num: D11, pin_signal: PIO0_28/FC4_SCK/CTIMER4_MAT0/I2S_BRIDGE_CLK_OUT/SEC_PIO0_28, label: SSM2518_BCLK, identifier: SSM2518_BCLK}
- {pin_num: B10, pin_signal: PIO0_29/FC4_TXD_SCL_MISO_WS/CTIMER4_MAT1/I2S_BRIDGE_WS_OUT/SEC_PIO0_29, label: SSM2518_LRCLK, identifier: SSM2518_LRCLK}
- {pin_num: C11, pin_signal: PIO0_30/FC4_RXD_SDA_MOSI_DATA/CTIMER4_MAT2/I2S_BRIDGE_DATA_OUT/SEC_PIO0_30, label: SSM2518_SDATA, identifier: SSM2518_SDATA}
- {pin_num: A11, pin_signal: PIO0_31/FC4_CTS_SDA_SSEL0/SCT0_GPI0/SCT0_OUT6/CTIMER4_MAT3/FC3_SSEL2/SEC_PIO0_31, label: MEMS_WAKE, identifier: MEMS_WAKE}
- {pin_num: A7, pin_signal: PIO1_2/FC4_SSEL3/SCT0_GPI3/SCT0_OUT9/CTIMER1_MAT1/CMP0_C, label: BLE_BOOTn, identifier: BLE_BOOTn}
- {pin_num: G16, pin_signal: PIO1_3/FC5_SCK, label: SSM2518_SHTDNn, identifier: SSM2518_SHTDNn}
- {pin_num: G17, pin_signal: PIO1_4/FC5_TXD_SCL_MISO_WS, label: DEBUG_UART_TXD, identifier: DEBUG_UART_TXD}
- {pin_num: J16, pin_signal: PIO1_5/FC5_RXD_SDA_MOSI_DATA, label: DEBUG_UART_RXD, identifier: DEBUG_UART_RXD}
- {pin_num: J17, pin_signal: PIO1_6/FC5_CTS_SDA_SSEL0/SCT0_GPI4/SCT0_OUT4/FC4_SSEL2, label: EEG_DRDYn, identifier: EEG_DRDYn}
- {pin_num: B5, pin_signal: PIO1_8/FC5_SSEL2/SCT0_GPI6/CTIMER_INP12/CTIMER1_MAT2/ADC0_4, label: MEMS_ANALOG, identifier: MEMS_ANALOG}
- {pin_num: B1, pin_signal: PIO1_9/FC5_SSEL3/SCT0_GPI7/UTICK_CAP1/CTIMER1_MAT3/ADC0_12, label: HRM_INTn, identifier: HRM_INTn}
- {pin_num: N1, pin_signal: PIO1_13/HS_SPI_MOSI/CTIMER2_MAT2/FLEXSPI0B_DATA2, label: NOR_D2}
- {pin_num: T7, pin_signal: PIO1_24/FLEXSPI0A_DATA4/SCT0_GPI3, label: FLASH_MUX_SEL, identifier: FLASH_MUX_SEL}
- {pin_num: U7, pin_signal: PIO1_25/FLEXSPI0A_DATA5/SCT0_OUT3, label: HRM_IR_ANODE_EN, identifier: HRM_IR_ANODE_EN}
- {pin_num: T8, pin_signal: PIO1_27/FLEXSPI0A_DATA7/SCT0_OUT4, label: FLASH_MUX_EN, identifier: FLASH_MUX_EN}
- {pin_num: U9, pin_signal: PIO1_28/FLEXSPI0A_DQS/SCT0_GPI5, label: COLOR_LED}
- {pin_num: U11, pin_signal: PIO2_2/SD0_D2/SCT0_OUT0, label: BOOST_EN, identifier: BOOST_EN}
- {pin_num: T12, pin_signal: PIO2_3/SD0_D3/SCT0_OUT1, label: AUX_GPIO1, identifier: AUX_GPIO1}
- {pin_num: T13, pin_signal: PIO2_4/SD0_WR_PRT/SCT0_OUT2/SD0_DS, label: AUX_GPIO2, identifier: AUX_GPIO2}
- {pin_num: U15, pin_signal: PIO2_6/SD0_D5/SCT0_GPI4/CTIMER1_MAT0, label: AUX_GPIO3, identifier: AUX_GPIO3}
- {pin_num: U17, pin_signal: PIO2_8/SD0_D7/SCT0_OUT4/CTIMER1_MAT2, label: PS_HOLD, identifier: PS_HOLD}
- {pin_num: T1, pin_signal: PIO2_13/SCT0_OUT7/CTIMER2_MAT3/CMP0_OUT, label: MEMS_MODE, identifier: MEMS_MODE}
- {pin_num: L16, pin_signal: PIO2_24/SWO/GPIO_INT_BMAT, label: SWO}
- {pin_num: L17, pin_signal: PIO2_25/SWCLK, label: SWD_CLK}
- {pin_num: L15, pin_signal: PIO2_26/SWDIO, label: SWD_IO}
- {pin_num: T2, pin_signal: PIO2_19/PDM_CLK67/FLEXSPI0B_SS0_N, label: NOR_CSn}
- {pin_num: L2, pin_signal: PIO1_11/HS_SPI_SCK/CTIMER2_MAT0/FLEXSPI0B_DATA0, label: NOR_D0}
- {pin_num: M2, pin_signal: PIO1_12/HS_SPI_MISO/CTIMER2_MAT1/FLEXSPI0B_DATA1, label: NOR_D1}
- {pin_num: N2, pin_signal: PIO1_14/HS_SPI_SSEL0/CTIMER2_MAT3/FLEXSPI0B_DATA3, label: NOR_D3}
- {pin_num: N3, pin_signal: PIO1_15/HS_SPI_SSEL1/CTIMER3_MAT0, label: ISP0}
- {pin_num: M4, pin_signal: PIO1_16/HS_SPI_SSEL2/SCT0_OUT8/CTIMER3_MAT1, label: ISP1}
- {pin_num: N4, pin_signal: PIO1_17/HS_SPI_SSEL3/SCT0_OUT9/CTIMER3_MAT2, label: ISP2}
- {pin_num: K16, pin_signal: PIO1_10/MCLK/FREQME_GPIO_CLK/CTIMER_INP10/CLKOUT, label: ACCEL_INT, identifier: ACCEL_INT}
- {pin_num: P10, pin_signal: PIO1_30/SD0_CLK/SCT0_GPI0, label: HRM_RED_ANODE_EN, identifier: HRM_RED_ANODE_EN}
- {pin_num: U3, pin_signal: PIO1_29/FLEXSPI0A_SS1_N/SCT0_OUT5/UTICK_CAP2/CTIMER_INP13/FLEXSPI0B_SCLK, label: NOR_SCK}
- {pin_num: D6, pin_signal: PIO0_16/FC2_RXD_SDA_MOSI_DATA/SCT0_GPI2/SCT0_OUT2/CTIMER2_MAT2/I2S_BRIDGE_DATA_IN/SEC_PIO0_16, label: MAX86140_SDI, identifier: MAX86140_SDI}
- {pin_num: D8, pin_signal: PIO0_22/FC3_TXD_SCL_MISO_WS/CTIMER3_MAT1/TRACEDATA(0)/SEC_PIO0_22, label: ACTIVITY_BUTTON, identifier: ACTIVITY_BUTTON}
- {pin_num: B2, pin_signal: PIO0_20/FC2_SSEL3/SCT0_GPI5/SCT0_OUT5/CTIMER0_MAT2/CTIMER_INP11/SEC_PIO0_20/ADC0_10, label: USER_BUTTON2, identifier: USER_BUTTON2}
- {pin_num: G15, pin_signal: PIO1_1/FC4_SSEL2/SCT0_GPI2/SCT0_OUT8/CTIMER1_MAT0, label: ISP_ENTRY, identifier: ISP_ENTRY}
- {pin_num: G4, pin_signal: PIO0_2/FC0_RXD_SDA_MOSI_DATA/CTIMER0_MAT2/I2S_BRIDGE_DATA_IN/SEC_PIO0_2, label: BT_UART_RXD, identifier: BT_UART_RXD}
- {pin_num: J1, pin_signal: PIO0_4/FC0_RTS_SCL_SSEL1/CTIMER_INP0/FC1_SSEL3/CMP0_OUT/SEC_PIO0_4, label: BT_UART_RTSn, identifier: BT_UART_RTSn}
- {pin_num: H2, pin_signal: PIO0_3/FC0_CTS_SDA_SSEL0/CTIMER0_MAT3/FC1_SSEL2/SEC_PIO0_3, label: BT_UART_CTSn, identifier: BT_UART_CTSn}
- {pin_num: L3, pin_signal: PIO0_9/FC1_RXD_SDA_MOSI_DATA/SCT0_GPI6/SCT0_OUT6/CTIMER1_MAT2/I2S_BRIDGE_DATA_OUT/SEC_PIO0_9, label: EEG_MOSI, identifier: EEG_MOSI}
- {pin_num: K4, pin_signal: PIO0_8/FC1_TXD_SCL_MISO_WS/SCT0_GPI5/SCT0_OUT5/CTIMER1_MAT1/I2S_BRIDGE_WS_OUT/SEC_PIO0_8, label: EEG_MISO, identifier: EEG_MISO}
- {pin_num: J2, pin_signal: PIO0_7/FC1_SCK/SCT0_GPI4/SCT0_OUT4/CTIMER1_MAT0/I2S_BRIDGE_CLK_OUT/SEC_PIO0_7, label: EEG_SCLK, identifier: EEG_SCLK}
- {pin_num: J3, pin_signal: PIO0_10/FC1_CTS_SDA_SSEL0/SCT0_GPI7/SCT0_OUT7/CTIMER1_MAT3/FC0_SSEL2/SEC_PIO0_10, label: EEG_CSn, identifier: EEG_CSn}
- {pin_num: G1, pin_signal: PIO0_0/FC0_SCK/CTIMER0_MAT0/I2S_BRIDGE_CLK_IN/GPIO_INT_BMAT/SEC_PIO0_0, label: EEG_START, identifier: EEG_START}
- {pin_num: L1, pin_signal: PIO0_11/FC1_RTS_SCL_SSEL1/SCT0_GPI0/SCT0_OUT8/CTIMER_INP2/FC0_SSEL3/SEC_PIO0_11, label: EEG_PWDn, identifier: EEG_PWDn}
- {pin_num: J15, pin_signal: PIO1_7/FC5_RTS_SCL_SSEL1/SCT0_GPI5/SCT0_OUT5/CTIMER_INP9/FC4_SSEL3, label: EEG_RESETn, identifier: EEG_RESETn}
- {pin_num: E16, pin_signal: PMIC_I2C_SCL, label: PMIC_I2C_SCL, identifier: PMIC_I2C_SCL}
- {pin_num: F16, pin_signal: PMIC_I2C_SDA, label: PMIC_I2C_SDA, identifier: PMIC_I2C_SDA}
- {pin_num: B16, pin_signal: PMIC_MODE1, label: PMIC_MODE1, identifier: PMIC_MODE1}
- {pin_num: A16, pin_signal: LDO_ENABLE, label: PMIC_LDO_ENABLE, identifier: PMIC_LDO_ENABLE}
- {pin_num: C15, pin_signal: PMIC_MODE0, label: PMIC_MODE0, identifier: PMIC_MODE0}
- {pin_num: A15, pin_signal: PMIC_IRQ_N, label: PMIC_IRQ_N, identifier: PMIC_IRQ_N}
- {pin_num: B7, pin_signal: PIO0_18/FC2_RTS_SCL_SSEL1/SCT0_GPI6/SCT0_OUT6/CTIMER_INP4/FC5_SSEL3/SEC_PIO0_18, label: USER_BUTTON1, identifier: USER_BUTTON1}
- {pin_num: E17, pin_signal: PIO1_0/FC4_RTS_SCL_SSEL1/SCT0_GPI1/SCT0_OUT7/CTIMER_INP8/FC3_SSEL3, label: SSM2518_MCLK, identifier: SSM2518_MCLK}
- {pin_num: R11, pin_signal: PIO2_0/SD0_D0/SCT0_GPI2, label: DEBUG_LEDn, identifier: DEBUG_LEDn}
- {pin_num: T11, pin_signal: PIO2_1/SD0_D1/SCT0_GPI3, label: BLE_RESETn, identifier: BLE_RESETn}
- {pin_num: C1, pin_signal: PIO2_14/SCT0_OUT8/CTIMER_INP1/CMP0_A, label: LED_B_PWM, identifier: LED_B_PWM}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

